**CRUD Operations**

**1. CREATE DATABASE**

In [ ]:
import sqlite3

#For connecting python and mysql

def create_connection(db_file):
    """Create a database connection to a SQLite database"""
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(f"Connected to SQLite database: {db_file}")
    except sqlite3.Error as e:
        print(e)
    return conn

#Create

#3 Steps to execute a query - Create a string with the query, create a cursor and execute the string with cursor

def create_table(conn):
    #Create a table in the SQLite database
    try:
        sql_create_books_table = """
        CREATE TABLE IF NOT EXISTS books (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            title TEXT NOT NULL,
            author TEXT NOT NULL,
            published_date TEXT,
            isbn TEXT,
            pages INTEGER,
            cover TEXT,
            language TEXT
        );
        """
        cursor = conn.cursor()
        cursor.execute(sql_create_books_table)
        print("Books table created.")
    except sqlite3.Error as e:
        print(e)

db_file = "bookstore.db"
conn = create_connection(db_file)
if conn:
    create_table(conn)

Connected to SQLite database: bookstore.db
Books table created.

**2. READ AND INSERT Operation**

In [ ]:
def insert_book(conn, book):
    """Insert a new book into the books table"""
    sql = '''
    INSERT INTO books(title, author, published_date, isbn, pages, cover, language)
    VALUES(?,?,?,?,?,?,?)
    '''
    cursor = conn.cursor()
    cursor.execute(sql, book)
    conn.commit()
    return cursor.lastrowid

with conn:
    book_1 = ('The Catcher in the Rye', 'J.D. Salinger', '1951-07-16', '978-0-316-76948-0', 214, 'Paperback', 'English')
    book_2 = ('To Kill a Mockingbird', 'Harper Lee', '1960-07-11', '978-0-06-112008-4', 281, 'Hardcover', 'English')
    book_3 = ('Wuthering Heights', 'Emily Bronte', '1847-05-12', '128-0-08-623759-5', 269, 'paperback', 'English')
    book_4 = ('The Lord Of The Rings', 'John Ronald', '1937-08-22', '168-7-03-515759-5', 271, 'Hardcover', 'English')
    book_5 = ('War & Peace', 'Leo Tolstoy', '1867-08-22', '130-1-12-4567823-6', 150, 'paperback', 'English')
    book_6 = ('One Hundred Year Of Solitude ', 'Gabriel Garcia', '1967-12-13', '180-1-11-5256781-2', 160, 'paperback', 'English')

    insert_book(conn, book_1)
    insert_book(conn, book_2)
    insert_book(conn, book_3)
    insert_book(conn, book_4)
    insert_book(conn, book_5)
    insert_book(conn, book_6)
    print("Books inserted.")

Books inserted.

**QUERYING ON THE DATABASE**

In [ ]:
def select_all_books(conn):
    """Query all rows in the books table"""
    str1 = "SELECT * FROM books"
    cursor = conn.cursor()
    cursor.execute(str1)
    conn.commit

    rows = cursor.fetchall()

    for row in rows:
        print(row)

with conn:
    print("All books in the database:")
    select_all_books(conn)

All books in the database:
(1, 'The Catcher in the Rye', 'J.D. Salinger', '1951-07-16', '978-0-316-76948-0', 214, 'Paperback', 'English')
(2, 'To Kill a Mockingbird', 'Harper Lee', '1960-07-11', '978-0-06-112008-4', 281, 'Hardcover', 'English')
(3, 'Wuthering Heights', 'Emily Bronte', '1847-05-12', '128-0-08-623759-5', 269, 'paperback', 'English')
(4, 'The Lord Of The Rings', 'John Ronald', '1937-08-22', '168-7-03-515759-5', 271, 'Hardcover', 'English')
(5, 'War & Peace', 'Leo Tolstoy', '1867-08-22', '130-1-12-4567823-6', 150, 'paperback', 'English')
(6, 'One Hundred Year Of Solitude ', 'Gabriel Garcia', '1967-12-13', '180-1-11-5256781-2', 160, 'paperback', 'English')

**3. UPDATE OPERATION**

In [ ]:
def update_book(conn, book):
    """Update a book by id"""
    sql = '''
    UPDATE books
    SET title = ?,
        author = ?,
        published_date = ?,
        isbn = ?,
        pages = ?,
        cover = ?,
        language = ?
    WHERE id = ?
    '''
    cursor = conn.cursor()
    cursor.execute(sql, book)
    conn.commit()

with conn:
    updated_book = ('The Catcher in the Rye', 'Jerome David Salinger', '1951-07-16', '978-0-316-76948-0', 214, 'Paperback', 'English', 1)
    update_book(conn, updated_book)
    print("Book updated.")
    select_all_books(conn)

Book updated.
(1, 'The Catcher in the Rye', 'Jerome David Salinger', '1951-07-16', '978-0-316-76948-0', 214, 'Paperback', 'English')
(2, 'To Kill a Mockingbird', 'Harper Lee', '1960-07-11', '978-0-06-112008-4', 281, 'Hardcover', 'English')
(3, 'Wuthering Heights', 'Emily Bronte', '1847-05-12', '128-0-08-623759-5', 269, 'paperback', 'English')
(4, 'The Lord Of The Rings', 'John Ronald', '1937-08-22', '168-7-03-515759-5', 271, 'Hardcover', 'English')
(5, 'War & Peace', 'Leo Tolstoy', '1867-08-22', '130-1-12-4567823-6', 150, 'paperback', 'English')
(6, 'One Hundred Year Of Solitude ', 'Gabriel Garcia', '1967-12-13', '180-1-11-5256781-2', 160, 'paperback', 'English')

**4. DELETE OPERATION**

In [ ]:
def delete_book(conn, id):
    """Delete a book by id"""
    sql = 'DELETE FROM books WHERE id=?'
    cursor = conn.cursor()
    cursor.execute(sql, (id,))
    conn.commit()

with conn:
    delete_book(conn, 2)

    print("Book deleted.")
    select_all_books(conn)

Book deleted.
(1, 'The Catcher in the Rye', 'Jerome David Salinger', '1951-07-16', '978-0-316-76948-0', 214, 'Paperback', 'English')
(3, 'Wuthering Heights', 'Emily Bronte', '1847-05-12', '128-0-08-623759-5', 269, 'paperback', 'English')
(4, 'The Lord Of The Rings', 'John Ronald', '1937-08-22', '168-7-03-515759-5', 271, 'Hardcover', 'English')
(5, 'War & Peace', 'Leo Tolstoy', '1867-08-22', '130-1-12-4567823-6', 150, 'paperback', 'English')
(6, 'One Hundred Year Of Solitude ', 'Gabriel Garcia', '1967-12-13', '180-1-11-5256781-2', 160, 'paperback', 'English')

In [ ]:
import pandas as pd
from tabulate import tabulate

**TABULAR FORMAT PRINTING FOR DATABASE - BOOKS TABLE**

In [ ]:
def select_all_books(conn):
    """Query all rows in the books table and display them in a tabular format with '|' separators"""
    cursor = conn.cursor()
    cursor.execute("SELECT * FROM books")

    rows = cursor.fetchall()

    # Define column names - for visualisation on table
    columns = ['id', 'title', 'author', 'published_date', 'isbn', 'pages', 'cover', 'language']

    # Use tabulate to format the table
    table = tabulate(rows, headers=columns, tablefmt='pipe')

    # Display the table
    print(table)

# Query all books and display in tabular format
with conn:
    print("All books in the database:")
    select_all_books(conn)

All books in the database:
|   id | title                        | author                | published_date   | isbn               |   pages | cover     | language   |
|-----:|:-----------------------------|:----------------------|:-----------------|:-------------------|--------:|:----------|:-----------|
|    1 | The Catcher in the Rye       | Jerome David Salinger | 1951-07-16       | 978-0-316-76948-0  |     214 | Paperback | English    |
|    3 | Wuthering Heights            | Emily Bronte          | 1847-05-12       | 128-0-08-623759-5  |     269 | paperback | English    |
|    4 | The Lord Of The Rings        | John Ronald           | 1937-08-22       | 168-7-03-515759-5  |     271 | Hardcover | English    |
|    5 | War & Peace                  | Leo Tolstoy           | 1867-08-22       | 130-1-12-4567823-6 |     150 | paperback | English    |
|    6 | One Hundred Year Of Solitude | Gabriel Garcia        | 1967-12-13       | 180-1-11-5256781-2 |     160 | paperback | English    |